#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ ВКМ
	ВКМ_СоздатьЭлементыАбонентскогоОбслуживания();
	ВКМ_УстановитьВидимостьАбонентскогоОбслуживанияНаСервере();
	//-- ВКМ
	
КонецПроцедуры
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//++ ВКМ
	ВКМ_УстановитьВидимостьАбонентскогоОбслуживанияНаСервере();
	//-- ВКМ
	
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВКМ_УстановитьВидимостьАбонентскогоОбслуживания();
	
КонецПроцедуры
#КонецОбласти
#Область ВКМ_СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВКМ_СоздатьЭлементыАбонентскогоОбслуживания()
	

	Родитель = Элементы.ВКМ_ГруппаАбонентскогоОбслуживания;
	Если Элементы.Найти("ВКМ_ДатаНачалаДействия") = Неопределено Тогда
		Элемент = Элементы.Добавить("ВКМ_ДатаНачалаДействия", Тип("ПолеФормы"), Родитель);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействия";
		Элемент.Заголовок = НСтр("ru = 'Дата начала действия'");
	КонецЕсли;
	Если Элементы.Найти("ВКМ_ДатаОкончанияДействия") = Неопределено Тогда
		Элемент = Элементы.Добавить("ВКМ_ДатаОкончанияДействия", Тип("ПолеФормы"), Родитель);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействия";
		Элемент.Заголовок = НСтр("ru = 'Дата окончания действия'");
	КонецЕсли;
	Если Элементы.Найти("ВКМ_СуммаАбонентскойПлаты") = Неопределено Тогда
		Элемент = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), Родитель);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		Элемент.Заголовок = НСтр("ru = 'Сумма абонентской платы'");
	КонецЕсли;
	Если Элементы.Найти("ВКМ_СтоимостьЧасаРаботы") = Неопределено Тогда
		Элемент = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), Родитель);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		Элемент.Заголовок = НСтр("ru = 'Стоимость часа работы'");
	КонецЕсли;

	
КонецПроцедуры
&НаКлиенте
Процедура ВКМ_УстановитьВидимостьАбонентскогоОбслуживания()
	
	ВКМ_УстановитьВидимостьАбонентскогоОбслуживанияНаСервере();
	
КонецПроцедуры
&НаСервере
Процедура ВКМ_УстановитьВидимостьАбонентскогоОбслуживанияНаСервере()
	
	Видимость = Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание;
	Если Элементы.Найти("ВКМ_ГруппаАбонентскогоОбслуживания") <> Неопределено Тогда
		Элементы.ВКМ_ГруппаАбонентскогоОбслуживания.Видимость = Видимость;
	КонецЕсли;
	Если Элементы.Найти("ВКМ_ДатаНачалаДействия") <> Неопределено Тогда
		Элементы.ВКМ_ДатаНачалаДействия.Видимость = Видимость;
	КонецЕсли;
	Если Элементы.Найти("ВКМ_ДатаОкончанияДействия") <> Неопределено Тогда
		Элементы.ВКМ_ДатаОкончанияДействия.Видимость = Видимость;
	КонецЕсли;
	Если Элементы.Найти("ВКМ_СуммаАбонентскойПлаты") <> Неопределено Тогда
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Видимость;
	КонецЕсли;
	Если Элементы.Найти("ВКМ_СтоимостьЧасаРаботы") <> Неопределено Тогда
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Видимость;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти