#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДокументРезультат.Очистить();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Номенклатура = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		ВызватьИсключение НСтр("ru = 'Заполните константу ВКМ_НоменклатураРаботыСпециалиста.'");
	КонецЕсли;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	УстановитьПараметр(Настройки.ПараметрыДанных, "НоменклатураРаботыСпециалиста", Номенклатура);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

Процедура УстановитьПараметр(ПараметрыДанных, Имя, Значение)
	
	Элемент = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(Имя));
	Если Элемент <> Неопределено Тогда
		Элемент.Значение = Значение;
		Элемент.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
